{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "output_shape": [40, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\tmodel3.py\u00da\b<lambda>C\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "arguments": {}, "batch_input_shape": [null, 40, 160, 3], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "trainable": true, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_1", "activation": "linear", "W_regularizer": null, "bias": true, "subsample": [1, 1]}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 80, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "activation": "relu", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 40, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "activation": "relu", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "activation": "relu", "b_constraint": null, "bias": true, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true}}], "keras_version": "1.1.2"}